import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';

/**
 * Generated class for the TermPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-term',
  templateUrl: 'term.html',
})
export class TermPage {

  constructor(public navCtrl: NavController, public navParams: NavParams) {
  }

  ionViewDidLoad() {
    console.log('ionViewDidLoad TermPage');
  }
  
   
    foo = `<p>ข้อกำหนดและเงื่อนไข (Terms and Conditions)</p>

   <ol start="1" type="1">
<li>ผู้ใช้บริการจะต้องสมัครลงทะเบียน SLC Rewards ตามช่องทางที่บริษัทกำหนด</li>
<li>ทุกๆ 25 บาท ที่ผู้ใช้บริการชำระค่าสินค้าและ/หรือบริการทุกบริษัทในเครือ SLC รับคะแนนสะสม SLC Rewards 1 คะแนน </li>
<li> คะแนนสะสมจะแบ่งเป็นรอบทุก 4 เดือน ดังนี้ </li>
<ol start="1" type="1">
   <li> คะแนนสะสมช่วง มกราคม – เมษายนปีนี้ จะหมดอายุสิ้นเดือนเมษายนปีถัดไป</li>
    <li>คะแนนสะสมช่วง พฤษภาคม – สิงหาคมปีนี้ จะหมดอายุสิ้นเดือนสิงหาคมปีถัดไป</li>
    <li> คะแนนสะสมช่วง กันยายน – ธันวาคมปีนี้ จะหมดอายุสิ้นเดือนธันวาคมปีถัดไป
และท่านสามารถตรวจสอบคะแนนสะสมที่จะหมดอายุของท่านได้จากในหน้า “บัญชีผู้ใช้” </li>
</ol>
<li>คะแนนสะสมไม่สามารถแลกเปลี่ยนหรือขอคืนได้ไม่ว่ากรณีใดๆ ทั้งสิ้น</li>
<li>คะแนนสะสมไม่สามารถเปลี่ยนเป็นเงินสดได้</li>
<li>ในกรณีลงทะเบียนแอพพลิเคชั่น ผู้ใช้ที่มีหมายเลขประจำตัวผู้รับบริการ (HN/Member) แล้ว แต่เลือกสมัครสมาชิกเป็น “ลูกค้าใหม่” ทางบริษัทจะถือว่าหมายเลขประจำตัวผู้รับบริการใหม่ (HN/Member) เป็นปัจจุบัน ไม่สามารถนำคะแนนมารวมกันได้ และกรุณาใส่ข้อมูลปัจจุบันของท่านให้ตรงกับระบบฐานข้อมูลของบริษัท เพื่อประโยชน์ของท่านเอง</li>
<li>บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
</ol>

<p>นโยบายความเป็นส่วนตัว (Privacy Policy)</p>

<ol start="1" type="1">
<li>บริษัทมีนโยบายในการคุ้มครองข้อมูลส่วนบุคคลของผู้ใช้บริการทุกท่านอย่างดีที่สุด โดยปัจจุบันบริษัทได้ใช้ระบบรักษาความปลอดภัยที่ได้มาตรฐานระดับสากล เพื่อคุ้มครองข้อมูลดังกล่าว อย่างไรก็ตาม เพื่อความปลอดภัยในข้อมูลส่วนบุคคลของท่าน ท่านควรปฏิบัติตามข้อกำหนดและเงื่อนไขการให้บริการอย่างเคร่งครัด ในกรณีที่ข้อมูลส่วนบุคคลดังกล่าว ถูกจารกรรมโดยวิธีการทางอิเล็กทรอนิกส์ (hack) หรือสูญหาย เสียหายอันเนื่องจากเหตุสุดวิสัยหรือไม่ว่ากรณีใดๆ ทั้งสิ้น บริษัทขอสงวนสิทธิในการปฏิเสธความรับผิดจากเหตุดังกล่าวทั้งหมด</li>

<li>การเข้าใช้งานและทำรายการใดๆ ที่เกิดขึ้นจากการ Login ผ่านรหัสสมาชิกและรหัสผ่านของท่านในแอพพลิเคชั่น SLC Rewards ให้ถือว่าการกระทำดังกล่าวถูกต้องสมบูรณ์และเป็นการกระทำของท่านเอง หากมีความเสียหายใดๆ เกิดขึ้น ไม่ว่าจะด้วยกรณีใดๆ ก็ตาม ท่านจะต้องรับผิดชอบในการกระทำดังกล่าวทุกประการ และท่านตกลงจะไม่โต้แย้งหรือเรียกร้องให้ทางบริษัทรับผิดชอบชดใช้ค่าเสียหายใดๆ ทั้งสิ้น</li>
</ol>`;


}
